register_form_text_values = {
    'Фамилия': 'Петров',
    'Имя': 'Иван',
    'Отчество': 'Васильевич',
    'Дата рождения': '10.01.1980',
    'Электронная почта': 'test_mail@yandex.ru',
    'ВОШ-логин': 'v00.000.000',
    'Телефон': '910-110-10-10',
    'СНИЛС': '08336732477',
    'Профессия': 'Студент',
    'Страна': 'Россия',
    'Город': 'Москва',
    'Название организации': 'Организация',
    'Школа': 'Школа',
    'Класс': '10',
}

page_letter_confirmation = {
    'eng_text': 'We sent an email with a personal link for completing tasks to test_mail@yandex.ru',
    'ru_text': 'Мы отправили письмо с персональной ссылкой для выполнения заданий на почту test_mail@yandex.ru'
}

snils_length_error = {
    'Имя поля': 'СНИЛС',
    'Значение': '123',
    'Текст ошибки': 'СНИЛС должен состоять ровно из 11 цифр'
}

snils_only_numbers_error = {
    'Имя поля': 'СНИЛС',
    'Значение': 'qwerty',
    'Текст ошибки': 'СНИЛС должен содержать только цифры'
}

wrong_vosh_login = {
    'Имя поля': 'ВОШ-логин',
    'Значение': 'qwerty',
    'Текст ошибки': 'Неверный ВОШ-логин. Попробуйте ещё раз'
}
